package Lab1;

// Создать класс Hello, который будет приветствовать любого пользователя,
// используя командную строку.

class Hello {
    public static void say() {
        System.out.println("Lab1.Hello!");
    }
}

public class Variant11 {
    public static void main(String[] args) {
        Hello.say();
    }
}